Revit 2026 API

# SpatialFieldManagerRemoveSpatialFieldPrimitive Method

---

Removes analysis results primitive identified by the unique index

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSpatialFieldPrimitive(
	int idx
)
```
```vb
Public Sub RemoveSpatialFieldPrimitive (
	idx As Integer
)
```
```cpp
public:
void RemoveSpatialFieldPrimitive(
	int idx
)
```
```fsharp
member RemoveSpatialFieldPrimitive :
        idx : int -> unit
```

#### Parameters

idx Int32
     Unique index identifying the primitive

| Exception | Condition |
| --- | --- |
| ArgumentException | idx refers to non-existent primitive |

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace